; domain
(define (domain Nasa_strips_advanced_model_withSoftConstraints)

;; =====
;; REQUIREMENTS
;; =====

(:requirements :strips :typing :fluents :negative-preconditions :disjunctive-preconditions :equality :existential-preconditions :quantified-preconditions :conditional-effects :adl)

;; =====
;; TYPES
;; =====

(:types 
	crew activity location  - objects
)


;; =====        
;; PREDICATES
;; =====

(:predicates
	(daystarted)
	(daycompleted)
	(assign_crewmember ?crmem - crew ?wrt - activity)	
	(deactivatingactivityforcrew ?wrt - activity)
	(typeofactivitynormal  ?actvar - activity)
	(typeofactivitytype0 ?actvar - activity)
	(inordercrew ?crew1 - crew ?crew2 - crew)	
	(currentcrewmember ?crew - crew)
	(cannotassigncrew ?wrt - activity)
	(busy_crewmember ?crew1 - crew)
	(blocked_location ?loc - location)
	(changelevel ?crew1 - crew)
	(latch_open)
	(activated_activity_forloc ?wrt - activity ?loc - location)
	(activated_activity_forcrew ?wrt  - activity)
	(activitycompleted ?wrt - activity)
	(activityinprogress)
	(recentlyused ?crmem - crew)
	(useonlyonceforcleanup)
        (useforincreasingthecbustvalue)
)

;; =====
;; FUNCTIONS
;; =====

(:functions 
	(rem_time_today_forall)
	(rem_time_today ?crmem - crew)
	(number_of_crew_members ?wrt - activity)
	(max_crewmember_for_activity ?wrt - activity)
	(decreaseintime)
	(cannotbeusedtill)
	(revecountcannotbeusedtill)
)

;; =====
;; ACTIONS
;; =====

(:action starting_day
	:parameters ()
	:precondition (and(not(daystarted)))
	:effect (and(daystarted))
)

;;(:action cleanrrecentlyusedtaskone 
;;	:parameters(?wrt - activity)
;;	:precondition(and(>(cannotbeusedtill)0)
;;			(not(useonlyonceforcleanup))
;;			(deactivatingactivityforcrew ?wrt))
;;	:effect(and(useonlyonceforcleanup)(decrease(cannotbeusedtill)(max_crewmember_for_activity ?wrt)))

;;)

(:action cleanrrecentlyusedtaskone
	:parameters()
	:precondition(and(useforincreasingthecbustvalue)(<(revecountcannotbeusedtill)4)(>(cannotbeusedtill)0))
	:effect(and(increase(revecountcannotbeusedtill)1)(decrease(cannotbeusedtill)1)(not(useforincreasingthecbustvalue)))

)

(:action cleanrrecentlyusedtasktwo
	:parameters(?crmem - crew)
	:precondition(and(=(revecountcannotbeusedtill)4)(<(cannotbeusedtill)4))
	:effect(and(not(recentlyused ?crmem))(increase(cannotbeusedtill)1))

)

(:action cleanrrecentlyusedtaskthree
	:parameters()
	:precondition(and(=(cannotbeusedtill)4)(=(revecountcannotbeusedtill)4))
	:effect(and(decrease(revecountcannotbeusedtill)4))
)



(:action starting_activity_normal 
	:parameters (?wrt - activity ?loc - location )
	
	:precondition(and
	(daystarted)
	(not(activitycompleted ?wrt))
	;;(useonlyonceforcleanup)
	(not(activityinprogress))
	(typeofactivitynormal ?wrt)
	(not(blocked_location ?loc)))
	
	:effect(and
	(blocked_location ?loc)
	(activityinprogress)
	;;(not(useonlyonceforcleanup))
	(activated_activity_forloc ?wrt ?loc)
	(activated_activity_forcrew ?wrt))
)

(:action starting_activity_type0 
	:parameters (?wrt - activity ?loc - location )
	
	:precondition(and
	(daystarted)	
	;;(useonlyonceforcleanup)
	(not(activitycompleted ?wrt))
	(not(activityinprogress))
	(typeofactivitytype0 ?wrt)
	(not(activitycompleted  ?wrt ))
	(not(blocked_location ?loc))
	(not(latch_open)))
	
	:effect(and
	(activityinprogress)
	(blocked_location ?loc)
        ;;(not(useonlyonceforcleanup))
	(activated_activity_forloc ?wrt ?loc)
	(activated_activity_forcrew ?wrt))
)

(:action assigning_current_crew_member
	:parameters(?crmem - crew ?crmem1 - crew)
	:precondition(and(currentcrewmember ?crmem)
					(busy_crewmember ?crmem)
					(inordercrew ?crmem ?crmem1)
				)
	:effect(and
	(not(currentcrewmember ?crmem))
	(currentcrewmember ?crmem1))

)


(:action assigning_crew_members_activity 
	:parameters (?wrt - activity ?crmem - crew )

	:precondition(and(activated_activity_forcrew ?wrt)
					(not(recentlyused ?crmem))
				 (not(busy_crewmember ?crmem))
				 (not(cannotassigncrew ?wrt))
			  (>(rem_time_today ?crmem)0)
			(<(number_of_crew_members ?wrt)(max_crewmember_for_activity ?wrt)))

	:effect(and
		(assign_crewmember ?crmem ?wrt)	
		(busy_crewmember ?crmem)
		(decrease(rem_time_today ?crmem)(decreaseintime))
		(decrease(rem_time_today_forall)(decreaseintime))
		(increase(number_of_crew_members ?wrt)1)	
		)
)

;;Checks if all crewmember are assigned and frees the location.
(:action free_location_after_assignment 
	:parameters (?wrt - activity ?loc - location)
	
	:precondition (and(activated_activity_forcrew ?wrt)
					(=(number_of_crew_members ?wrt)(max_crewmember_for_activity ?wrt))
							(activated_activity_forloc ?wrt ?loc)
							(blocked_location ?loc))

	:effect (and
				(cannotassigncrew ?wrt)
				(not(blocked_location ?loc))
				(deactivatingactivityforcrew ?wrt)
				(not(activated_activity_forloc ?wrt ?loc))
	)
)

;;Loop over crew member(s) and frees all of them one by one
(:action free_individual_crew_members
	:parameters (?wrt - activity ?crmem - crew)
	
	:precondition (and(deactivatingactivityforcrew ?wrt)
						(assign_crewmember ?crmem ?wrt)	
					(>(number_of_crew_members ?wrt)0))

	:effect (and
				(not(assign_crewmember ?crmem ?wrt))
				(not(busy_crewmember ?crmem))
				(useforincreasingthecbustvalue)
				(decrease(number_of_crew_members ?wrt)1)
				(recentlyused ?crmem)
				)
)


(:action complete_activity
	:parameters(?wrt - activity)
	:precondition(and(deactivatingactivityforcrew ?wrt)
					(activated_activity_forcrew ?wrt)			
					(=(number_of_crew_members ?wrt)0)					
					)
	:effect(and		
					(not(activityinprogress))				
					(activitycompleted ?wrt)
					(not(activated_activity_forcrew ?wrt))
					(not(deactivatingactivityforcrew ?wrt))					
					)
)

(:action complete_day
	:parameters()
	:precondition(and(daystarted)
					(not(activityinprogress))	
					(<=(rem_time_today_forall)0)			
					)
	:effect(and(not(daystarted))	
				(daycompleted)						
					)
)

)

; problem
(define (problem Nasa_strips_advanced_model_prob01)
(:domain Nasa_strips_advanced_model_withSoftConstraints)
(:objects
        CrewMember-1 CrewMember-2 CrewMember-3 CrewMember-4 - crew
        breakfast normalwork1 normalwork2 dinner meditation sleep lunch loading unloading t1exercise t2exercise mutationexp xrayexp communication xrayexp2 communication2 takephoto repairshuttle - activity
        locA locB locC locD locE locF - location
)
(:init
    (=(rem_time_today_forall)16)
    (=(rem_time_today CrewMember-1)4)
    (=(rem_time_today CrewMember-2)4)
    (=(rem_time_today CrewMember-3)4)
    (=(rem_time_today CrewMember-4)4)
	(useonlyonceforcleanup)
(=(decreaseintime)2)
(=(revecountcannotbeusedtill)0)
	(=(cannotbeusedtill)4)
    (=(number_of_crew_members breakfast)0)
    (=(number_of_crew_members normalwork1)0)
    (=(number_of_crew_members normalwork2)0)
    (=(number_of_crew_members dinner)0)
    (=(number_of_crew_members meditation)0)
    (=(number_of_crew_members sleep)0)
    (=(number_of_crew_members lunch)0)
    (=(number_of_crew_members loading)0)
    (=(number_of_crew_members unloading)0)
    (=(number_of_crew_members t1exercise)0)
    (=(number_of_crew_members t2exercise)0)
    (=(number_of_crew_members takephoto)0)
    (=(number_of_crew_members repairshuttle)0)
    (=(number_of_crew_members xrayexp)0)
    (=(number_of_crew_members communication)0)
    (=(number_of_crew_members xrayexp2)0)
    (=(number_of_crew_members communication2)0)
    ;;(latch_open)
    (=(max_crewmember_for_activity breakfast)4)
    (=(max_crewmember_for_activity normalwork1)4)
    (=(max_crewmember_for_activity normalwork2)4)
    (=(max_crewmember_for_activity dinner)4)
    (=(max_crewmember_for_activity meditation)4)
    (=(max_crewmember_for_activity sleep)4)
    (=(max_crewmember_for_activity lunch)4)
    (=(max_crewmember_for_activity loading)4)
    (=(max_crewmember_for_activity unloading)4)
    (=(max_crewmember_for_activity t1exercise)4)
    (=(max_crewmember_for_activity t2exercise)4)
    (=(max_crewmember_for_activity takephoto)4)
    (=(max_crewmember_for_activity repairshuttle)4)
    (=(max_crewmember_for_activity xrayexp)3)
    (=(max_crewmember_for_activity communication)3)
    (=(max_crewmember_for_activity xrayexp2)1)
    (=(max_crewmember_for_activity communication2)1)


    (typeofactivitynormal breakfast)
    (typeofactivitynormal normalwork1)
    (typeofactivitynormal normalwork2)
    (typeofactivitynormal dinner)
    (typeofactivitynormal meditation)
    (typeofactivitynormal sleep)
    (typeofactivitynormal lunch)
    (typeofactivitynormal loading)
    (typeofactivitynormal unloading)
    (typeofactivitynormal t1exercise)
    (typeofactivitynormal t2exercise)
    (typeofactivitynormal takephoto)
    (typeofactivitynormal repairshuttle)
    (typeofactivitynormal xrayexp)
    (typeofactivitytype0 communication)
    (typeofactivitynormal xrayexp2)
    (typeofactivitytype0 communication2)
    
    (currentcrewmember CrewMember-1)
    (inordercrew CrewMember-1 CrewMember-2)
    (inordercrew CrewMember-2 CrewMember-3)
    (inordercrew CrewMember-3 CrewMember-4)
    (inordercrew CrewMember-4 CrewMember-1)

)


(:goal(and(daycompleted)
)

)

)

; plan
1. (starting_day)
   added: (daystarted)
   goals met: 0 of 1
2. (starting_activity_normal breakfast locf)
   added: (blocked_location locf) (activityinprogress) (activated_activity_forloc breakfast locf) (activated_activity_forcrew breakfast)
   goals met: 0 of 1
3. (assigning_crew_members_activity breakfast crewmember-1)
   added: (assign_crewmember crewmember-1 breakfast) (busy_crewmember crewmember-1)
   changed: (rem_time_today crewmember-1) from 4 to 2, (rem_time_today_forall) from 16 to 14, (number_of_crew_members breakfast) from 0 to 1
   goals met: 0 of 1
4. (assigning_crew_members_activity breakfast crewmember-2)
   added: (assign_crewmember crewmember-2 breakfast) (busy_crewmember crewmember-2)
   changed: (rem_time_today crewmember-2) from 4 to 2, (rem_time_today_forall) from 14 to 12, (number_of_crew_members breakfast) from 1 to 2
   goals met: 0 of 1
5. (assigning_crew_members_activity breakfast crewmember-3)
   added: (assign_crewmember crewmember-3 breakfast) (busy_crewmember crewmember-3)
   changed: (rem_time_today crewmember-3) from 4 to 2, (rem_time_today_forall) from 12 to 10, (number_of_crew_members breakfast) from 2 to 3
   goals met: 0 of 1
6. (assigning_crew_members_activity breakfast crewmember-4)
   added: (assign_crewmember crewmember-4 breakfast) (busy_crewmember crewmember-4)
   changed: (rem_time_today crewmember-4) from 4 to 2, (rem_time_today_forall) from 10 to 8, (number_of_crew_members breakfast) from 3 to 4
   goals met: 0 of 1
7. (free_location_after_assignment breakfast locf)
   deleted: (blocked_location locf) (activated_activity_forloc breakfast locf)
   added: (cannotassigncrew breakfast) (deactivatingactivityforcrew breakfast)
   goals met: 0 of 1
8. (free_individual_crew_members breakfast crewmember-1)
   deleted: (assign_crewmember crewmember-1 breakfast) (busy_crewmember crewmember-1)
   added: (useforincreasingthecbustvalue) (recentlyused crewmember-1)
   changed: (number_of_crew_members breakfast) from 4 to 3
   goals met: 0 of 1
9. (cleanrrecentlyusedtaskone)
   deleted: (useforincreasingthecbustvalue)
   changed: (revecountcannotbeusedtill) from 0 to 1, (cannotbeusedtill) from 4 to 3
   goals met: 0 of 1
10. (free_individual_crew_members breakfast crewmember-2)
   deleted: (assign_crewmember crewmember-2 breakfast) (busy_crewmember crewmember-2)
   added: (useforincreasingthecbustvalue) (recentlyused crewmember-2)
   changed: (number_of_crew_members breakfast) from 3 to 2
   goals met: 0 of 1
11. (cleanrrecentlyusedtaskone)
   deleted: (useforincreasingthecbustvalue)
   changed: (revecountcannotbeusedtill) from 1 to 2, (cannotbeusedtill) from 3 to 2
   goals met: 0 of 1
12. (free_individual_crew_members breakfast crewmember-3)
   deleted: (assign_crewmember crewmember-3 breakfast) (busy_crewmember crewmember-3)
   added: (useforincreasingthecbustvalue) (recentlyused crewmember-3)
   changed: (number_of_crew_members breakfast) from 2 to 1
   goals met: 0 of 1
13. (cleanrrecentlyusedtaskone)
   deleted: (useforincreasingthecbustvalue)
   changed: (revecountcannotbeusedtill) from 2 to 3, (cannotbeusedtill) from 2 to 1
   goals met: 0 of 1
14. (free_individual_crew_members breakfast crewmember-4)
   deleted: (assign_crewmember crewmember-4 breakfast) (busy_crewmember crewmember-4)
   added: (useforincreasingthecbustvalue) (recentlyused crewmember-4)
   changed: (number_of_crew_members breakfast) from 1 to 0
   goals met: 0 of 1
15. (cleanrrecentlyusedtaskone)
   deleted: (useforincreasingthecbustvalue)
   changed: (revecountcannotbeusedtill) from 3 to 4, (cannotbeusedtill) from 1 to 0
   goals met: 0 of 1
16. (complete_activity breakfast)
   deleted: (activityinprogress) (activated_activity_forcrew breakfast) (deactivatingactivityforcrew breakfast)
   added: (activitycompleted breakfast)
   goals met: 0 of 1
17. (cleanrrecentlyusedtasktwo crewmember-1)
   deleted: (recentlyused crewmember-1)
   changed: (cannotbeusedtill) from 0 to 1
   goals met: 0 of 1
18. (cleanrrecentlyusedtasktwo crewmember-2)
   deleted: (recentlyused crewmember-2)
   changed: (cannotbeusedtill) from 1 to 2
   goals met: 0 of 1
19. (cleanrrecentlyusedtasktwo crewmember-3)
   deleted: (recentlyused crewmember-3)
   changed: (cannotbeusedtill) from 2 to 3
   goals met: 0 of 1
20. (cleanrrecentlyusedtasktwo crewmember-4)
   deleted: (recentlyused crewmember-4)
   changed: (cannotbeusedtill) from 3 to 4
   goals met: 0 of 1
21. (cleanrrecentlyusedtaskthree)
   changed: (revecountcannotbeusedtill) from 4 to 0
   goals met: 0 of 1
22. (starting_activity_normal lunch locf)
   added: (blocked_location locf) (activityinprogress) (activated_activity_forloc lunch locf) (activated_activity_forcrew lunch)
   goals met: 0 of 1
23. (assigning_crew_members_activity lunch crewmember-1)
   added: (assign_crewmember crewmember-1 lunch) (busy_crewmember crewmember-1)
   changed: (rem_time_today crewmember-1) from 2 to 0, (rem_time_today_forall) from 8 to 6, (number_of_crew_members lunch) from 0 to 1
   goals met: 0 of 1
24. (assigning_crew_members_activity lunch crewmember-2)
   added: (assign_crewmember crewmember-2 lunch) (busy_crewmember crewmember-2)
   changed: (rem_time_today crewmember-2) from 2 to 0, (rem_time_today_forall) from 6 to 4, (number_of_crew_members lunch) from 1 to 2
   goals met: 0 of 1
25. (assigning_crew_members_activity lunch crewmember-3)
   added: (assign_crewmember crewmember-3 lunch) (busy_crewmember crewmember-3)
   changed: (rem_time_today crewmember-3) from 2 to 0, (rem_time_today_forall) from 4 to 2, (number_of_crew_members lunch) from 2 to 3
   goals met: 0 of 1
26. (assigning_crew_members_activity lunch crewmember-4)
   added: (assign_crewmember crewmember-4 lunch) (busy_crewmember crewmember-4)
   changed: (rem_time_today crewmember-4) from 2 to 0, (rem_time_today_forall) from 2 to 0, (number_of_crew_members lunch) from 3 to 4
   goals met: 0 of 1
27. (free_location_after_assignment lunch locf)
   deleted: (blocked_location locf) (activated_activity_forloc lunch locf)
   added: (cannotassigncrew lunch) (deactivatingactivityforcrew lunch)
   goals met: 0 of 1
28. (free_individual_crew_members lunch crewmember-1)
   deleted: (assign_crewmember crewmember-1 lunch) (busy_crewmember crewmember-1)
   added: (useforincreasingthecbustvalue) (recentlyused crewmember-1)
   changed: (number_of_crew_members lunch) from 4 to 3
   goals met: 0 of 1
29. (cleanrrecentlyusedtaskone)
   deleted: (useforincreasingthecbustvalue)
   changed: (revecountcannotbeusedtill) from 0 to 1, (cannotbeusedtill) from 4 to 3
   goals met: 0 of 1
30. (free_individual_crew_members lunch crewmember-2)
   deleted: (assign_crewmember crewmember-2 lunch) (busy_crewmember crewmember-2)
   added: (useforincreasingthecbustvalue) (recentlyused crewmember-2)
   changed: (number_of_crew_members lunch) from 3 to 2
   goals met: 0 of 1
31. (cleanrrecentlyusedtaskone)
   deleted: (useforincreasingthecbustvalue)
   changed: (revecountcannotbeusedtill) from 1 to 2, (cannotbeusedtill) from 3 to 2
   goals met: 0 of 1
32. (free_individual_crew_members lunch crewmember-3)
   deleted: (assign_crewmember crewmember-3 lunch) (busy_crewmember crewmember-3)
   added: (useforincreasingthecbustvalue) (recentlyused crewmember-3)
   changed: (number_of_crew_members lunch) from 2 to 1
   goals met: 0 of 1
33. (cleanrrecentlyusedtaskone)
   deleted: (useforincreasingthecbustvalue)
   changed: (revecountcannotbeusedtill) from 2 to 3, (cannotbeusedtill) from 2 to 1
   goals met: 0 of 1
34. (free_individual_crew_members lunch crewmember-4)
   deleted: (assign_crewmember crewmember-4 lunch) (busy_crewmember crewmember-4)
   added: (useforincreasingthecbustvalue) (recentlyused crewmember-4)
   changed: (number_of_crew_members lunch) from 1 to 0
   goals met: 0 of 1
35. (cleanrrecentlyusedtaskone)
   deleted: (useforincreasingthecbustvalue)
   changed: (revecountcannotbeusedtill) from 3 to 4, (cannotbeusedtill) from 1 to 0
   goals met: 0 of 1
36. (complete_activity lunch)
   deleted: (activityinprogress) (activated_activity_forcrew lunch) (deactivatingactivityforcrew lunch)
   added: (activitycompleted lunch)
   goals met: 0 of 1
37. (cleanrrecentlyusedtasktwo crewmember-1)
   deleted: (recentlyused crewmember-1)
   changed: (cannotbeusedtill) from 0 to 1
   goals met: 0 of 1
38. (cleanrrecentlyusedtasktwo crewmember-2)
   deleted: (recentlyused crewmember-2)
   changed: (cannotbeusedtill) from 1 to 2
   goals met: 0 of 1
39. (cleanrrecentlyusedtasktwo crewmember-3)
   deleted: (recentlyused crewmember-3)
   changed: (cannotbeusedtill) from 2 to 3
   goals met: 0 of 1
40. (cleanrrecentlyusedtasktwo crewmember-4)
   deleted: (recentlyused crewmember-4)
   changed: (cannotbeusedtill) from 3 to 4
   goals met: 0 of 1
41. (cleanrrecentlyusedtaskthree)
   changed: (revecountcannotbeusedtill) from 4 to 0
   goals met: 0 of 1
42. (complete_day)
   deleted: (daystarted)
   added: (daycompleted)
   goals met: 1 of 1
